swak4Foam/Examples/RegionSolvers/pitzDailyWithRASInlet/0.org/inChannel/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (10 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    wall
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (10 0 0);
    }
    inChannel_to_pitz
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
